Infineon/mtb-example-psoc4-msclp-low-power-csd-touchpad-4mm-overlay/main.c
    /*******************************************************************************
     * If the CSD Touchpad is active, Turn On LED2 and LED3
     * with Green color, and vary the intensity of the LED as per the finger
     * position reported
     *******************************************************************************/
    if (SENSOR_ACTIVE == Cy_CapSense_IsWidgetActive(CY_CAPSENSE_TOUCHPAD_SELF_CAP_WDGT_ID, &cy_capsense_context))
    {
        panelTouch = Cy_CapSense_GetTouchInfo(CY_CAPSENSE_TOUCHPAD_SELF_CAP_WDGT_ID, &   cy_capsense_context);

        touchposition_x = (panelTouch->ptrPosition->x);
        touchposition_y = (panelTouch->ptrPosition->y);

        /* LED3 Turns ON and brightness increases when the finger is swiped from left to right  */
        Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_0_HW, CYBSP_PWM_0_NUM, (MAXIMUM_BRIGHTNESS_LED - touchposition_x));


        /* LED2 Turns ON and brightness ncreases when the finger is swiped from bottom to top */
        Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_1_HW, CYBSP_PWM_1_NUM, touchposition_y);
    }
    else
    {
        /* Turn OFF LED */
        Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_0_HW, CYBSP_PWM_0_NUM, 0);
        Cy_TCPWM_PWM_SetCompare0(CYBSP_PWM_1_HW, CYBSP_PWM_1_NUM, 0);
    }


}
#endif

/*******************************************************************************
 * Function Name: register_callback
 ********************************************************************************
 *
 * Summary:
 *  Register Deep Sleep callbacks for EzI2C, SPI components
 *
 * Parameters:
 *  void
 *
 * Return:
 *  void
 *
 *******************************************************************************/
void register_callback(void)
{
    /* Register EzI2C Deep Sleep callback */
    Cy_SysPm_RegisterCallback(&ezi2cCallback);

    /* Register Deep Sleep callback */
    Cy_SysPm_RegisterCallback(&deepSleepCb);
}

/*******************************************************************************
 * Function Name: deep_sleep_callback
 ********************************************************************************
 *
 * Summary:
 * Deep Sleep callback implementation. Waits for the completion of SPI transaction.
 * And change the SPI GPIOs to highZ while transition to deep-sleep and vice-versa
 *
 * Parameters:
 *  callbackParams: The pointer to the callback parameters structure cy_stc_syspm_callback_params_t.
 *  mode: Callback mode, see cy_en_syspm_callback_mode_t
 *
 * Return:
 *  Entered status, see cy_en_syspm_status_t.
 *
 *******************************************************************************/
cy_en_syspm_status_t deep_sleep_callback(
        cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t ret_val = CY_SYSPM_FAIL;

    switch (mode)
    {
        case CY_SYSPM_CHECK_READY:

            ret_val = CY_SYSPM_SUCCESS;
            break;

        case CY_SYSPM_CHECK_FAIL:

            ret_val = CY_SYSPM_SUCCESS;
            break;

        case CY_SYSPM_BEFORE_TRANSITION:

            ret_val = CY_SYSPM_SUCCESS;
            break;

        case CY_SYSPM_AFTER_TRANSITION:

            ret_val = CY_SYSPM_SUCCESS;
            break;

        default:
            /* Don't do anything in the other modes */
            ret_val = CY_SYSPM_SUCCESS;
            break;
    }
    return ret_val;
}

void PWM_initialisation(void)
{
    /* Initialize PWM block */
    (void)Cy_TCPWM_PWM_Init(CYBSP_PWM_0_HW, CYBSP_PWM_0_NUM, &CYBSP_PWM_0_config);
    (void)Cy_TCPWM_PWM_Init(CYBSP_PWM_1_HW, CYBSP_PWM_1_NUM, &CYBSP_PWM_1_config);
    /* Enable the initialized PWM */
    Cy_TCPWM_Enable_Multiple(CYBSP_PWM_0_HW, CYBSP_PWM_0_MASK);
    Cy_TCPWM_Enable_Multiple(CYBSP_PWM_1_HW, CYBSP_PWM_1_MASK);
    /* Then start the PWM */
    Cy_TCPWM_TriggerReloadOrIndex(CYBSP_PWM_0_HW, CYBSP_PWM_0_MASK);
    Cy_TCPWM_TriggerReloadOrIndex(CYBSP_PWM_1_HW, CYBSP_PWM_1_MASK);

}

/* [] END OF FILE */
